import shuffleArray from "../components/shuffleArray"

const posts = [
  { id: 1, content: `اللهم صلِّ وسلم وبارك على سيد المرسلين وإمام النبيين ورحمة الله للعالمين، صفوتِك وخاصتك من خلقك؛ أبي القاسم الطيب المُطَيَّب حيًّا وميتًا، الفخم المُفخَّم، النور الهادي إلى صراطك المستقيم.
الحمد لله على نعمته علينا بشرف الانتساب والإيمان به غيبًا، والحنين إليه شوقا وحبا!
` },
{ id: 23, content: `يا زارعَ حُبَّ النبيِّ بقلبي
    أسقيتُ زرعي بالصلاةِ عليهِ ﷺ`},
{ id: 2, content: `لما رأيت أنواره سطعت  
وضعت من خيفتي كفي على بصري 
خـوفـاً على بصري من حسن صورته
فلـست أنظره إلّا عـلى قـدرٍ
روح من النور في جسم من القمر
كحلية نسجت بالأنجم الـزهرٍ.
<br/>
<br/>
سيدنا حسان بن ثابت`},
{ id: 502, content: `- الصلاة على النبي ﷺ يوم الجمعة أفضل من بقيّة الأيام، وليلتها أفضل الليالي، قال ﷺ :

  ("إن من أفضل أيامكم يوم الجمعة فأكثروا عليَّ من الصلاة فيه")
  
  🌹 من سنن #يوم_الجمعة
  
  ➊ الغسل
  ➋ الطيب
  ➌ السواك
  ➍ لبس الجميل
  ➎ قراءة سورة الكهف
  ➏ التبكير لصلاة الجمعة
  ➐ الإكثار من الصلاة على النبي محمد ﷺ
  
  اللهمَّ صَلِّ وَسَـــلِّمْ وَبَارِك على سيدنا ونبينا مُحمَّد وعلى آله وصحبه وسلم تسليماً كثيراً‏.` },
{ id: 3, content: `يا خيرَ مَنْ وَطِئَ الحَصَى أقدامُه 
كلُّ الفضائلِ قَدْ حَباه الباري 
مَنْ هَدْيُه هَدْيُ السماءِ وريحُه 
أزكى وأنعشُ مِن شميمِ عَرارِ 
يا أُسْوةً يا قُدْوةً يا مَنْ بِه 
سُبُل الهدايةِ بُيِّنتْ للسَّاري
<br/>
<br/>
أكثروا من الصلاة على النبي في يوم الجمعة 🤍
`},

{ id: 43, content: `"جمعة طيبة ومباركة عليكم جميعًا 🌿✨
اجعلوا يومكم عامرًا بذكر الله، وقراءة سورة الكهف، والإكثار من الصلاة على النبي ﷺ.
{ألا بذكر الله تطمئن القلوب} – سورة الرعد، آية 28.

جمعة_طيبة 🌸"`},
{ id: 25, content: `صَلىٰ عَليِكَ اللُّه يَا مَن ذِكرُهُ
شَرَحَ الصُّدُورَ وَطَيَّبَ الآفَاقَا

إِنْ لَم نَكُن مِمَن رَأَكَ فَإِنَّنَا
شوقًا إِلِيكَ نُعَانِقُ الأَشْوَاقَا!

{ اللَّهُمَّ صَلِّ وَسَلِمْ عَلَىْ نَبِينَا مُحَمَّدْ ﷺ }`},
{ id: 5556, content: `يا رَبِّ صَلِّ وَسَلِّم ما أَرَدتَ عَلى : نَزيلِ عَرشِكَ خَيرِ الرُسلِ كُلِّهِمِ
مُحيِ اللَيالي صَلاةً لا يُقَطِّعُها :: إِلا بِدَمعٍ مِنَ الإِشفاقِ مُنسَجِمِ`},
{ id: 77, content: `مُحَمَّدٌ صَفوَةُ الباري وَرَحمَتُهُ وَبُغيَةُ اللَهِ مِن خَلقٍ وَمِن نَسَمِ وَصاحِبُ الحَوضِ يَومَ الرُسلِ سائِلَةٌمَتى الوُرودُ وَجِبريلُ الأَمينُ ظَمي سَناؤُهُ وَسَناهُ الشَمسُ طالِعَةًفَالجِرمُ في فَلَكٍ وَالضَوءُ في عَلَمِ`},
{ id: 301, content: `‏صلوا على الهادي البشير وسلّموا
كي تؤجـروا يـوم الجزاء و تغنموا 
هـو رحمــةٌ للعــالمين وقـــدوةٌ 
وله الشفاعــةُ والمقـامُ الأعظـم

صَلوَ عَلىْ اْلنَّبِيِ ..ﷺ ..💚🌹☘`},

{ id: 110, content: `مِنْ سُنَنِ يَوْمِ الْجُمُعَةِ:
1-الْإِغْتِسَالُ
2-التَّطَيّبُ
3-لُبْسُ الْجَمِيلِ
4-التَّسَوّكُ
5-قِرَاءَةُ سُورَةِ الْكَهْفِ
6-الْإِكْثَارُ مِنَ الدُّعَاءِ
7-التَّبْكِيرُ إِلَى الْمَسْجِدِ
8-تَحَرّي سَاعَةِ الْإِجَابَةِ

وَكَذَلِكَ الصَّلَاةُ عَلَى النَّبِيِّ ﷺ عَلَى مَدَارِ الْيَوْمِ.💧` },
{ id: 456, content: `
‏"صلّى عليك الله يا غيمًا همىٰ 
‏فوق القُلوب، فحلّت الرحمات ﷺ"` },
{ id: 789, content: `
‏"نبيٌّ تَهادَى النورُ مِن طَلَعاتِه
‏طوبَى لمَن صلىٰ عليهِ وسلّمَا" ﷺ` },
{ id: 923, content: `
‏"اللهُم صل وسلم على نبينا مُحمد ، وارزقنا اللهُم و 
‏والدينا جواره في جنةٍ عرضها السماوات و الأرض"🌿..` },
{ id: 1201, content: `‏"إنَّ الصَّلاةَ على النَّبيِّ لَبَلْسَمٌ
‏يشفي الفُؤادَ ويُذْهِبُ الأوْجاعَا"ﷺ.` },
{ id: 340, content: `
‏قال رسول الله ﷺ :
‏خيرُ الدعاءِ دعاءُ يومِ عرفة ، وخيرُ ما قلتُ أنا والنَّبيون مِن قبلي "لا إله إلا الله وحده لا شريك له له المُلك وله الحمد وهو على كلِّ شيءٍ قدير"

‏-قد ينال المؤمن بدعاءِ أخيهِ ما لا يُدركه بدعائِه لنفسِه. 
‏لا تنسوني من دعائكم انا ومن أحّب🤍.` },
// { id: 220, content: `` },
// { id: 888, content: `` },
// { id: 999, content: `` },
// { id: 1502, content: `` },
// { id: 2030, content: `` },
// { id: 404, content: `` },
// { id: 608, content: `` },
// { id: 1001, content: `` },
// { id: 275, content: `` },
  // Add more posts here
];



const hadith = [
    {
      id: 5,
      content: `قال رسول الله ﷺ :
    من قرأ سورة الكهف في يوم الجمعة أضاء له من النور ما بين الجمعتين.`,
},
{ id: 6, content: `قال النبي ﷺ :
" أكثروا من الصلاة عليَّ ليلة الجمعة ويوم الجمعة فإن صلاتكم معروضة عليَّ "` },
  {
    id: 4,
    content: `"الصلاة إلى الصلاة، والجمعة إلى الجمعة، ورمضان إلى رمضان مكفرات لما بينهن إذا اجتنبت الكبائر."
<br/>
<br/>
    (رواه مسلم)
`,
},
{ id: 7, content: ` من صلَّى عليَّ صلاةً واحدةً ؛ صلَّى اللهُ عليه عشرَ صلواتٍ ، وحطَّ عنه عشرَ خطيئاتٍ` },
  {
    id: 1,
    content:
      "عن أبي هريرة أن رسول الله صلى الله عليه وسلم ذكر يوم الجمعة فقال: (فيها ساعة لا يوافقها عبد مسلم وهو قائم يُصلي يسأل الله شيئاً إلا أعطاه الله وأشار بيده يُقلّلها) رواه البخاري (الجمعة/883)",
  },
  {
    id: 2,
    content:
      'عن النبي صلى الله عليه وسلم أنه قال: (إن من أفضل أيامكم يوم الجمعة، فيه خلق آدم وفيه قُبض، وفيه النفخة، وفيه الصعقة، فأكثروا عليَّ من الصلاة فيه، فإن صلاتكم معروضة عليَّ) قالوا: وكيف تُعرض صلاتنا عليك وقد أرمت؟ -أي: بَلِيت-. فقال: (إن الله جل وعلا حرَّم على الأرض أن تأكل أجسامنا) رواه أبو داود، والنسائي، وصححه الألباني في "صحيح الترغيب والترهيب" برقم (695).',
  },
  {
    id: 3,
    content:
      "قال صلى الله عليه وسلم: إن من أفضل أيامكم يوم الجمعة؛ فيه خلق آدم, وفيه قبض, وفيه النفخة, وفيه الصعقة, فأكثروا علي من الصلاة فيه, فإن صلاتكم معروضة علي، قال: قالوا: يا رسول الله, وكيف تعرض صلاتنا عليك وقد أرمت؟ يقولون: بليت، فقال: إن الله عز وجل حرم على الأرض أجساد الأنبياء. رواه أبو داود والنسائي وابن ماجه وغيرهم وصححه الشيخ الألباني.",
  },
  { id: 8, content: `من توضأ فأحسن الوضوء ثم أتى الجمعة فاستمع وأنصت، غُفر له ما بينه وبين الجمعة وزيادة ثلاثة أيام، ومن مسَّ الحصى فقد لغا` },
  { id: 9, content: `وروِي عن أنس بن مالك رضي الله عنه عن النبي صلى الله عليه وسلم: (التمسوا الساعة التي ترجى في يوم الجمعة بعد صلاة العصر إلى غيبوبة الشمس) رواه الترمذي وحسنه الألباني في "صحيح الترغيب والترهيب" برقم (700).` },
  { id: 10, content: `قال رسول الله صلى الله عليه وسلم: (خَيْرُ يَوْمٍ طَلَعَتْ عَلَيْهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ، فِيهِ خُلِقَ آدَمُ، وَفِيهِ أُدْخِلَ الْجَنَّةَ، وَفِيهِ أُخْرِجَ مِنْهَا) رواه مسلم` },
//   { id: 11, content: `` },
];
export default shuffleArray(posts);
export const hadiths =  shuffleArray(hadith)